Repository: detiDevs/circuitquest
Catalog: lib/l10n/app_*.arb
Languages: de

# appDescription
source: Master Digital Logic and Processor Design
de: Meistere Rechnerarchitektur und Prozessorentwicklung

# sandboxModeTitle
source: Sandbox Mode
de: Sandbox-Modus

# sandboxModeDescription
source: Design circuits freely without constraints
de: Entwerfe eigene Schaltungen ohne Einschränkungen

# levelModeTitle
source: Level Mode
de: Level Modus

# levelModeDescription
source: Complete circuit challenges and progress through levels
de: Lerne spielerisch anhand von Levels

source: Failed to load levels
de: Fehler beim Laden der Level

source: Failed to load level
de: Fehler beim laden des Levels

source: Select a level
de: Wähle ein level

source: No levels available
de: Keine Level verfügbar

source: Recommended level
de: Empfohlenes level

source: Available components
de: Verfügbare Komponenten

# levelDescription
source: Description
de: Beschreibung

# levelObjectives
source: Objectives
de: Ziele

# levelHints
source: Hints
de: Tipps

# controlsTitle
source: Controls
de: Steuerung

source: Evaluate Circuit
de: Schaltkreis auswerten

source: Circuit evaluated
de: Schaltkreis ausgewertet

source: Start Simulation
de: Simulation starten

source: Stop Simulation
de: Simulation stoppen

source: Simulation speed
de: Geschwindigkeit

# simulationSpeedInstant
source: Instant
de: Ohne Verzögerung

# resetCircuitToInitialState
source: Reset to Initial State
de: Auf Ausgangszustand zurücksetzen

# circuitWasResetToInitialState
source: Circuit reset to initial state
de: Auf Ausgangszustand zurückgesetzt

# fileOperationsTitle
source: File Operations
de: Dateioptionen

source: Save Circuit
de: Schaltkreis speichern

source: Save as Custom Component
de: Als eigene Komponente speichern

# customComponentsNeedInputOutputError
source: Custom components need at least one input and one output.
de: Eigene Komponenten brauchen mindestens einen Input und einen Output.

source: Load Circuit
de: Schaltkreis laden

source: Check solution
de: Lösung überprüfen

source: Clear Circuit
de: Schaltkreis löschen

# clearCircuitConfirmTitle
source: Clear Circuit
de: Schaltkreis löschen

# clearCircuitConfirmMessage
source: Are you sure you want to clear the entire circuit? This action cannot be undone.
de: Möchten Sie wirklich den gesamten Schaltkreis löschen? Diese Aktion kann nicht rückgängig gemacht werden.

source: Circuit cleared
de: Schaltkreis gelöscht

source: Clear
de: Löschen

# circuitInfoTitle
source: Circuit Info
de: Schaltkreis-Info

# componentsLabel
source: Components
de: Komponenten

# connectionsLabel
source: Connections
de: Verbindungen

# statusRunning
source: Running
de: Läuft

# statusStopped
source: Stopped
de: Gestoppt

# instructionsTitle
source: Instructions
de: Anleitung

# instructionDragComponents
source: Drag components from the palette to the canvas
de: Ziehen Sie Komponenten aus der Palette auf die Arbeitsfläche

# instructionMoveComponents
source: Move components by dragging them on the canvas
de: Verschieben Sie Komponenten durch Ziehen auf der Arbeitsfläche

# instructionStartWires
source: Tap output pins to start drawing wires
de: Tippen Sie auf Ausgangspins, um Drähte zu zeichnen

# instructionCompleteWires
source: Tap input pins to complete wire connections
de: Tippen Sie auf Eingangspins, um Drahtverbindungen abzuschließen

# instructionDeleteComponents
source: Long-press components to delete them
de: Drücken Sie lange auf Komponenten, um sie zu löschen

# instructionEvaluate
source: Evaluate to run the circuit once
de: Auswerten, um den Schaltkreis einmal auszuführen

# pinColorsInfo
source: Pin colors: Green = HIGH (1), Red = LOW (0)
de: Pin-Farben: Grün = HIGH (1), Rot = LOW (0)

# componentPaletteTitle
source: Components
de: Komponenten

# componentSelected
source: {componentName} selected
de: {componentName} ausgewählt

source: AND Gate
de: AND-Gatter

source: OR Gate
de: OR-Gatter

source: NOT Gate
de: NOT-Gatter

source: NAND Gate
de: NAND-Gatter

source: NOR Gate
de: NOR-Gatter

source: XOR Gate
de: XOR-Gatter

source: Clock
de: Takt

# inputSource
source: Input
de: Eingang

# outputProbe
source: Output
de: Ausgang

# componentMenuTitle
source: {componentType} Component
de: {componentType}-Komponente

# componentMenuPrompt
source: What would you like to do?
de: Was möchten Sie tun?

source: Toggle bitwidth
de: Bitbreite umschalten

# outputLabel
source: {bitWidth}-bit output
de: {bitWidth}-Bit Ausgang

# customComponentName
source: Component name
de: Komponentenname

# customComponentDefaultName
source: My Custom Component
de: Meine eigene Komponente

# customComponentInputKeysLabel
source: Input keys
de: Eingangsschlüssel

# customComponentOutputKeysLabel
source: Output keys
de: Ausgangsschlüssel

# customComponentInputLabel
source: Input {index} (bitwidth: {bitWidth})
de: Eingang {index} (Bitbreite: {bitWidth})

# customComponentOutputLabel
source: Output {index} (bitwidth: {bitWidth})
de: Ausgang {index} (Bitbreite: {bitWidth})

# customComponentSelectImage
source: Select image
de: Bild wählen

# customComponentNameCannotBeEmptyError
source: Component name cannot be empty.
de: Komponentenname darf nicht leer sein

# customComponentKeysCannotBeEmptyError
source: Input/output keys cannot be empty.
de: Input/output keys dürfen nicht leer sein

# customComponentBuildDataError
source: Unable to build custom component data.
de: Fehler beim Erstellen der Komponentendaten

# customComponentSavingError
source: Failed to save custom component.
de: Fehler beim Speichern der Komponente

source: Custom component saved.
de: Komponente gespeichert

# circuitDefaultName
source: My Circuit
de: Mein Schaltkreis

# circuitDefaultDescription
source: Circuit created in sandbox mode
de: Schaltkreis im Sandbox-Modus erstellt

# circuitNameLabel
source: Circuit Name
de: Schaltkreisname

# circuitSavedTo
source: Circuit saved to {path}
de: Schaltkreis gespeichert unter {path}

# circuitSaveError
source: Error saving circuit: {error}
de: Fehler beim Speichern des Schaltkreises: {error}

# loadCircuitConfirmMessage
source: Loading a circuit will clear the current circuit. Continue?
de: Beim Laden wird der aktuelle Schaltkreis gelöscht. Fortfahren?

# loadCircuitAction
source: Load
de: Laden

# circuitLoadedSuccess
source: Circuit loaded successfully
de: Schaltkreis erfolgreich geladen

# circuitLoadedError
source: Error loading circuit
de: Fehler beim Laden des Schaltkreises

# circuitLoadError
source: Error loading circuit: {error}
de: Fehler beim Laden des Schaltkreises: {error}

source: Settings
de: Einstellungen

source: Language
de: Sprache

source: System default
de: Systemeinstellung

source: Retry
de: Erneut versuchen

source: Selected
de: Ausgewählt

source: Show
de: Anzeigen

source: Hide
de: Ausblenden

# levelInformationTooltip
source: Level Information
de: Level-Informationen

source: Cancel
de: Abbrechen

source: Delete
de: Löschen

source: Save
de: Speichern

source: Description
de: Beschreibung
