{
    "level_id": 10,
    "name": "D-Latch",
    "description": "Building on the RS-Flipflop, a D latch is a digital memory element that stores one bit of information. It has two main inputs: the data input (D) and the enable input (sometimes called gate, clock, or latch enable). When the enable input is active (1), the output Q follows the data input D immediately, making the latch \"transparent.\" When the enable input is deactivated (0), the latch holds or \"stores\" the last value present at the data input, regardless of any further changes to D. A D-Latch removes the invalid RS combination by creating S and R from a data input D. The clock imput C is the upper input and the data input D is the lower input.",
    "difficulty": "Middle",
    "objectives": [
        "Build a D-Latch using two NOR gates, two AND gates and one NOT gate."," "
    ],
    "components": [
        {"type": "Input", "position": [0,1], "immovable": true},
        {"type": "Input", "position": [0,5], "immovable": true},
        {"type": "Output", "position": [8,1], "immovable": true},
        {"type":  "Output", "position": [8,5], "immovable": true}

    ],
    "available_components": [
        {"type": "Nor"},
        {"type": "And"},
        {"type": "Not"}
    ],
    "hints": [
        "Try To rebuild a RS-Flipflop using two NOR gates first.",
        "As seen in the RS Flipflop the Q output changes by switching which of the two inputs is 1 and which is 0. In the D-Latch we want to control when the output changes, by only changing the Q output when the clock input is 1. ",
        "Use AND Gates to check if the clock input is 1. Connect the output of the AND gates to the inputs of the RS Flipfop.",
        "Connect D to the upper AND Gate and the inverted D, using a Not Gate, to the lower AND Gate."
    ],
    "tests": [
        {
            "inputs": [[1,1], [1,1]],
            "expected_output": [[1,1], [0,1]]
        },
        {
            "inputs": [[0,1], [0,1]],
            "expected_output": [[1,1], [0,1]]
        },
        {
            "inputs": [[0,1], [1,1]],
            "expected_output": [[1,1], [0,1]]
        },
        {
            "inputs": [[1,1], [0,1]],
            "expected_output": [[0,1], [1,1]]
        },
        {

            "inputs": [[0,1], [0,1]],
            "expected_output": [[0,1], [1,1]]
        },
        {
            "inputs": [[0,1], [1,1]],
            "expected_output": [[0,1], [1,1]]
        },
        {
            "inputs": [[1,1], [1,1]],
            "expected_output": [[1,1], [0,1]]
        }

    ]

}